02_OpenFOAM_FVM/cases/Ejercicio5/couetteHighRe/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          incompressibleFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         4000;

deltaT          1;

writeControl    runTime;

writeInterval   100;

purgeWrite      5;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //

libs ("libutilityFunctionObjects.so" "libfieldFunctionObjects.so");

functions
{
    graphUniform
    {
        type            graphUniform;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        
        start           (0.05 0 0.005);
        end             (0.05 0.1 0.005);
        nPoints         1000;
        
        fields          (U);
        axis            y;
    }
}


