02_OpenFOAM_FVM/cases/Ejercicio5/couetteHighRe/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;


RAS
{
    // High-Re: Standard kEpsilon with wall functions
    model           kEpsilon;
    turbulence      on;
    viscosityModel  Newtonian;

}



laminar
{
    model               Maxwell;

    MaxwellCoeffs
    {
        nuM             1;
        lambda          5;
    }

}

// ************************************************************************* //
