02_OpenFOAM_FVM/cases/Ejercicio5/couetteHighRe/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    movingWall
    {
              type            kqRWallFunction;
        value           uniform 0.375;

    }
    bottomWall
    {
              type            kqRWallFunction;
        value           uniform 0.375;
 
    }
    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
