02_OpenFOAM_FVM/cases/Ejercicio5/couetteHighRe/system/graphUniform
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start and
    end points. A specified number of graph points are used, distributed
    uniformly along the line.

\*---------------------------------------------------------------------------*/

start           (0.05 0 0);
end             (0.05 0.1 0);
nPoints         1000;

fields          (U);

axis            xyz; // The independent variable of the graph. Can be "x",
                          // "y", "z", "xyz" (all coordinates written out), or
                          // "distance" (from the start point).
writeControl    writeTime;       // or writeTime
#includeEtc "caseDicts/functions/graphs/graphUniform.cfg"

// ************************************************************************* //
